# 1st program
print(9 ** 0.5 * 5)
# 2nd program
print(9.99 > 9.98 and 1000 != 1000.1)
# 3rd program
print(2 * 2 + 2 == 2 * (2 + 2))
# 4th program
print(int(float("123.456") * 10) % 10) # сначала перобр строку в дроб число и вывели 4 в целое float("123.456") * 10
                                       # после полученное число 1234.56 % 10 остаток от деления
                                       # разобралась только по тексту задачи. вторую часть не поняла. Как мы выводим
                                       # выводим остаток от деления